app/views/purchases/new.html.erb

SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <%if(params[:merchandise_id].present?)%>
      <% merch = Merchandise.find(params[:merchandise_id]) %>